{
  "metadata": {
    "scraped_at": "2025-12-04T12:23:57.539251",
    "total_events": 17,
    "scraper_version": "3.0",
    "venue_ids": [
      190,
      191,
      192,
      193,
      196,
      197,
      198
    ],
    "source_ids": [],
    "city_id": 27,
    "event_type": "workshop"
  },
  "events": [
    {
      "title": "Data HK Prize, Keluaran HK Pools, Togel Hongkong, Pengeluaran HK Hari Ini",
      "description": "TogelData HK Prize, Keluaran HK Pools, Togel Hongkong, Pengeluaran HK Hari IniImage 1 ofData HK Prize, Keluaran HK Pools, Togel Hongkong, Pengeluaran HK Hari IniIDR 898Data HKprize mengumpulkan informasi lengkap mengenai hasil keluaran hk pools dan pengeluaran hk hari ini dari result togel hongkong lotto. Seluruh hasil keluaran hongkong malam ini menjadi kunci penting bagi totobet hk prize dalam mendapatkan angka keluar hk resmi dan akurat. Karena di Indonesia sendiri permainan togel hongkong hari ini merupakan kegiatan ilegal yang membuat setiap informasi sulit untuk dicari. Namun dengan layanan kami ini, para bettor bisa mendapatkan info data pengeluaran hongkong dengan mudah. Seluruh angka jackpot dari togel hk prize telah disimpan dan dikemas dengan sebaik mungkin kedalam tabel data hongkong pools.Quantity:ADD TO CART",
      "start_date": "2025-12-04",
      "end_date": "2025-12-04",
      "start_time": null,
      "end_time": null,
      "start_location": "Orange County Great Park",
      "meeting_point": null,
      "venue_id": 191,
      "city_id": 27,
      "event_type": "tour",
      "url": "https://www.ocgp.org#page",
      "image_url": "https://suzyeatondesigns.com/img/logohk.png",
      "source": "website",
      "source_url": "https://www.ocgp.org",
      "organizer": "Orange County Great Park"
    },
    {
      "title": "Museum Tour - Pretend City Children's Museum",
      "description": "",
      "start_date": "2025-12-04",
      "end_date": "2025-12-04",
      "start_time": null,
      "end_time": null,
      "start_location": "Pretend City Children's Museum",
      "meeting_point": null,
      "venue_id": 193,
      "city_id": 27,
      "event_type": "tour",
      "url": "https://www.pretendcity.org/virtual-tour-our-social-story/",
      "image_url": null,
      "source": "website",
      "source_url": "https://www.pretendcity.org",
      "organizer": "Pretend City Children's Museum"
    },
    {
      "title": "Little Hands, Big Impact",
      "description": "",
      "start_date": "2025-12-04",
      "end_date": "2025-12-04",
      "start_time": null,
      "end_time": null,
      "start_location": "Pretend City Children's Museum",
      "meeting_point": null,
      "venue_id": 193,
      "city_id": 27,
      "event_type": "tour",
      "url": "https://www.pretendcity.org/virtual-tour-our-social-story/",
      "image_url": null,
      "source": "website",
      "source_url": "https://www.pretendcity.org",
      "organizer": "Pretend City Children's Museum"
    },
    {
      "title": "December 10, 2025",
      "description": "Meetings are held on the second Wednesday of each month at the Irvine Civic Center, Council Chamber. For directions, please call 949-724-7365. Clickhereto view Sustainability Commission agendas.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Upcoming EventsDecember 10, 2025Sustainability Commission4:00pmJanuary 14, 2026Sustainability Commission4:00pmFebruary 11, 2026Sustainability Commission4:00pmView All Sustainability Division Events",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/sustainability-commission-23",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Upcoming EventsDecember 10, 2025Sustainability Commission4:00pmJanuary 14, 2026Sustainability Commission4:00pmFebruary 11, 2026Sustainability Commission4:00pmView All Sustainability Division Events"
    },
    {
      "title": "Get Email UpdatesGet Irvine eco-news and tips delivered right to your mailbox!View Past IssuesSUBSCRIBE",
      "description": "Issue No.65 Issue No.64 Issue No.63 Issue No.62 Issue No.61 Issue No.60 Issue No.59 Issue No.58 Issue No.57 Issue No.56 Issue No.55 Issue No.54 Issue No.53 Issue No.52 Issue No.51 Issue No.50 Issue No.49 Issue No.48 Issue No.47 Issue No.46 Issue No. 45 Issue No. 44 Issue No. 43 Issue No. 42 Issue No. 41 Issue No. 40 Issue No. 39 Issue No. 38 Issue No. 37 Issue No. 36 Issue No. 35 Issue No. 34 Issue No. 33 Issue No. 32 Issue No. 31 Issue No. 30 Issue No. 29 Issue No. 28 Issue No. 27 Issue No. 26 Issue No. 25 Issue No. 24 Issue No. 23",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Get Email UpdatesGet Irvine eco-news and tips delivered right to your mailbox!View Past IssuesSUBSCRIBE",
      "url": "https://www.cityofirvine.org/node/16511",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Get Email UpdatesGet Irvine eco-news and tips delivered right to your mailbox!View Past IssuesSUBSCRIBE"
    },
    {
      "title": "City of Irvine",
      "description": "LiveAffordable HousingChild Care & DevelopmentChildren, Teens & FamiliesCity Parks & FacilitiesClasses & ActivitiesDisability ServicesHealth ResourcesIrvine Community GuideIrvine GivesNew to IrvineOlder Adult ServicesRenter ResourcesSchools & LibrariesSeek AssistanceUtilitiesVolunteer OpportunitiesWorkAboutBids and RFP's (Purchasing)City JobsCity ServicesCodes, Licenses & PermitsDoing BusinessOnline Building & Planning ServicesTransportationUtilitiesYouth Employment ResourcesPlayAquatics CentersArts in IrvineAthletics & SportsBikewaysCity CalendarClasses & ActivitiesGreat ParkOpen Space & TrailsParks & FacilitiesRacket SportsSpecial EventsGovernmentCity BudgetCity CouncilCity PoliciesCity PrioritiesCommissionsDepartmentsAdministrative Services DepartmentCity ClerkCity Manager's OfficeCommunications & EngagementCommunity & Library ServicesCommunity DevelopmentHuman Resources DepartmentIrvine Police DepartmentPublic WorksTransportationSustainability DivisionPublic Records RequestSuccessor Agency/Oversight BoardServicesServices A to ZAnimal ServicesCity ClerkDE&IEconomic DevelopmentEnvironmental ProgramsFacility ReservationsGIS / Parcel MapsHealth and Human ServicesHomeless ServicesFOR FamiliesForms DirectoryFrequently Asked QuestionsIrvine Animal Care CenterMilitary / VeteransOlder Adult ServicesOnline Invoice PaymentPublic RecognitionNews & MediaCity CalendarCommunications ToolkitICTVInside IrvinePress InquiriesNewsroomPress ReleasesCommunity Link NewsletterRoad Construction NewsletterContactCity Council & StaffInvite City CouncilHow Can We Help?Report Short-Term Rentals & Boarding HousesMedia & Webmaster ContactsSign up for City Emails",
      "start_date": null,
      "end_date": null,
      "start_time": "07:30:00",
      "end_time": "17:30:00",
      "start_location": "City of IrvineTranslateAfrikaansAlbanianArabicArmenianAzerbaijaniBasqueBelarusianBengaliBosnianBulgarianCatalanCebuanoChinese (Simplified)Chinese (Traditional)CroatianCzechDanishDutchEnglishEsperantoEstonianFilipinoFinnishFrenchGalicianGeorgianGermanGreekGujaratiHaitian CreoleHausaHebrewHindiHmongHungarianIcelandicIgboIndonesianIrishItalianJapaneseJavaneseKannadaKhmerKoreanLaoLatinLatvianLithuanianMacedonianMalayMalteseMaoriMarathiMongolianNepaliNorwegianPersianPolishPortuguesePunjabiRomanianRussianSerbianSlovakSlovenianSomaliSpanishSwahiliSwedishTamilTeluguThaiTurkishUkrainianUrduVietnameseWelshYiddishYorubaZuluText SizeDecrease Font-SizeIncrease Font-SizeSearch formSearchHomeMenuSearchLiveAffordable HousingChild Care & DevelopmentChildren, Teens & FamiliesCity Parks & FacilitiesClasses & ActivitiesDisability ServicesHealth ResourcesIrvine Community GuideIrvine GivesNew to IrvineOlder Adult ServicesRenter ResourcesSchools & LibrariesSeek AssistanceUtilitiesVolunteer OpportunitiesWorkAboutBids and RFP's (Purchasing)City JobsCity ServicesCodes, Licenses & PermitsDoing BusinessOnline Building & Planning ServicesTransportationUtilitiesYouth Employment ResourcesPlayAquatics CentersArts in IrvineAthletics & SportsBikewaysCity CalendarClasses & ActivitiesGreat ParkOpen Space & TrailsParks & FacilitiesRacket SportsSpecial EventsGovernmentCity BudgetCity CouncilCity PoliciesCity PrioritiesCommissionsDepartmentsAdministrative Services DepartmentCity ClerkCity Manager's OfficeCommunications & EngagementCommunity & Library ServicesCommunity DevelopmentHuman Resources DepartmentIrvine Police DepartmentPublic WorksTransportationSustainability DivisionPublic Records RequestSuccessor Agency/Oversight BoardServicesServices A to ZAnimal ServicesCity ClerkDE&IEconomic DevelopmentEnvironmental ProgramsFacility ReservationsGIS / Parcel MapsHealth and Human ServicesHomeless ServicesFOR FamiliesForms DirectoryFrequently Asked QuestionsIrvine Animal Care CenterMilitary / VeteransOlder Adult ServicesOnline Invoice PaymentPublic RecognitionNews & MediaCity CalendarCommunications ToolkitICTVInside IrvinePress InquiriesNewsroomPress ReleasesCommunity Link NewsletterRoad Construction NewsletterContactCity Council & StaffInvite City CouncilHow Can We Help?Report Short-Term Rentals & Boarding HousesMedia & Webmaster ContactsSign up for City EmailsYou are hereHome•News & Media•ListListGridFind EventsKeyword searchDepartment- Any -Aquatics CentersArts in IrvineAthletics & SportsChild Care & DevelopmentCommunity & Library Services DepartmentDisability ServicesGreat ParkIrvine Animal Care CenterIrvine Police DepartmentIrvine Public LibraryMilitary / VeteransRacket SportsSustainability DivisionVenue- Any -Administrative Services DepartmentAdventure PlaygroundAl and Dorothy Keen Center for Senior ResourcesAlderwood Elementary SchoolAlderwood ParkArts & Learning ConservancyATA Martial ArtsBethel Koren ChurchBill Barber ParkBJ's Restaurant & BrewhouseBlue Gum ParkBommer Canyon PreserveBommer Canyon TrailheadBommer Vista PointBonita Canyon Elementary SchoolBrywood Elementary SchoolBrywood ParkCafe RioCanyon ParkCanyon View Elementary SchoolCarrotwood ParkCentral Bark Dog ParkChaparral ParkChild Care Coordination OfficeCitrusglen ParkCity ClerkCity CouncilCity Council ChamberCity Manager's OfficeCity of Irvine – Tennis ProgramCity ParksCode EnforcementCollege ParkCollege Park Elementary SchoolColonel Bill Barber Marine Corps Memorial ParkCommunications & Engagement DepartmentCommunity & Library ServicesCommunity & Library Services DepartmentCommunity DevelopmentCommunity Development: Housing Element UpdateComstock ParkConference and Training Center (CTC)Conference and Training Center (CTC)Coralwood ParkCreekside High School (CHS)Creekview ParkCulverdale Elementary SchoolCypress Community ParkCypress Village Elementary SchoolDavid Sills Lower Peters Canyon Community ParkDeerfield Community ParkDeerfield Elementary SchoolDisability ServicesDisc Golf CourseDovecreek ParkEastshore Elementary SchoolEnvironmental ProgramsFacility ReservationsFivePoint AmphitheatreFlagstone ParkGreat ParkGreat Park GalleryGreat Park IceGreentree Elementary SchoolHarvard Community CenterHarvard Community ParkHarvard Skate ParkHeritage Community ParkHeritage Park Community CenterHeritage Park Community CenterHeritage Park LibraryHeritage Park Sports Fields and ParksHicks Canyon Community ParkHoeptner ParkHomestead ParkHonda CenterHotel IrvineHuman ResourcesHuman Resources DepartmentIl-Do Tae Kwon Do Studio - Heritage PlazaInformation TechnologyIrvine Adult Day Health CenterIrvine Animal Care CenterIrvine Animal Care CenterIrvine Chamber of CommerceIrvine Child Development CenterIrvine Child Resource CenterIrvine Civic CenterIrvine Civic CenterIrvine Fine Arts CenterIrvine Fine Arts CenterIrvine High School (IHS)Irvine High School StadiumIrvine High School StadiumIrvine Historical MuseumIrvine ImprovIrvine LakeIrvine Marriott HotelIrvine Police DepartmentIrvine Police DepartmentIrvine Police DepartmentIrvine Public LibraryIrvine Ranch Conservancy - Portola Field OfficeIrvine Regional ParkIrvine Spectrum CenterIrvine Spectrum CenterIrvine Train StationIrvine Transportation CenterIrvine Unified School District (IUSD)Irvine Valley CollegeJeffrey Park and Ride LotJeffrey Trail Middle SchoolKatie Wheeler LibraryKnollcrest ParkLake Forest Sports Park and Recreation CenterLakeside Middle SchoolLakeview Senior CenterLas Lomas Community ParkLos Olivos Community CenterMagnolia Tree ParkMark Daily Athletic ParkMeadow Park Elementary SchoolMeadowood ParkMike Ward Community ParkMike Ward Community ParkMOD PizzaNewport Coast Community CenterNorthwood Community ParkNorthwood Elementary SchoolNorthwood High School (NHS)Northwood High School Aquatics CenterOak Creek Community ParkOak Creek Elementary SchoolOak Creek Golf CourseOC Fair & Event CenterOCFA Station 27Office of Emergency ManagementOffice of Health & WellnessOpen Space & Nature ProgramsOperations Support FacilityOrange County Fire Authority (OCFA)Orange County Housing AuthorityOrange County Transportation Authority (OCTA)Orange County Vector ControlOrchard ParkPacific Dance StudioPalm Court Arts ComplexPepperwood ParkPianoforte Music Studio - Heritage PlazaPinewood ParkPinewood ParkPlaza ParkPlaza Vista Elementary SchoolPlaza Vista Middle SchoolPortola High School (PHS)Portola Springs Community CenterPortola Springs Elementary SchoolPresley ParkPublic Works & SustainabilityPurchasing DivisionQuail Hill Community CenterQuail Hill Community ParkQuail Hill TrailheadRacquet Club ParkRanch ParkRancho San Joaquin Golf CourseRancho San Joaquin Middle SchoolRancho Senior CenterRed Robin, Irvine Spectrum CenterSan Carlo ParkSan Joaquin High School (SJHS)San Leandro ParkSan Marco ParkSantiago Hills Elementary SchoolSepulveda Vista PointSettlers ParkSierra Vista Middle SchoolSilkwood ParkSouth Coast Chinese Cultural AssociationSouth Coast Chinese Cultural CenterSouth Coast Chinese Cultural CenterSouth Coast Chinese Cultural CenterSouth Lake Middle SchoolSpringbrook Elementary SchoolStone Creek Elementary SchoolStonegate Elementary SchoolStonegate ParkStrawberry Farms Golf CourseSweet Shade Ability CenterSweet Shade Neighborhood ParkSweet Shade ParkSycamore ParkThe Village of HopeTierra Verde IndustriesTrabuco CenterTransportation DepartmentTurtle Rock Community ParkTurtle Rock Elementary SchoolTurtle Rock Nature CenterTustin Unified School District (TUSD)University Community ParkUniversity Community parkUniversity High School (UHS)University of California, Irvine (UCI)University Park Elementary SchoolUniversity Park LibraryValencia ParkValley Oak ParkVeggie Grill – Irvine Spectrum CenterVenado Middle SchoolVerizon Wireless AmphitheatreVista Verde Elementary SchoolVista Verde Middle SchoolWestpark Elementary SchoolWild RiversWildfire GymnasticsWilliam Woollett Jr. Aquatics CenterWillows ParkWindrow Community ParkWoodbridge High School (WHS)Woodbury Community CenterWoodbury Community ParkWoodbury Elementary SchoolYOGASMOGAYouth Employment InformationZoom AcademyNews & MediaCity CalendarCommunications ToolkitICTVInside IrvinePress InquiriesNewsroomPress ReleasesCommunity Link NewsletterRoad Construction NewsletterCity CalendarJanuaryFebruaryMarchAprilMayJuneJulyAugustSeptemberOctoberNovemberDecember2020202120222023202420252026« PrevNext »SunMonTueWedThuFriSat30123456Canceled - Finance Commission MeetingCANCELED- Transportation CommissionCommunity & Library Services CommissionPlanning CommissionWorkforce Development and Financial Empowerment WorkshopHolidayz at the Park78910111213Irvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-OffHealth & Wellness Advisory Committee MeetingCity Council MeetingCANCELED - Subdivision CommitteeZoning AdministratorSustainability CommissionFree Grocery Food Box for Irvine ResidentsWorkforce Development and Financial Empowerment WorkshopIrvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-OffMetrolink Holiday Express TrainMetrolink Holiday Express Train14151617181920Metrolink Holiday Express TrainMetrolink Holiday Express TrainFinance Commission MeetingTransportation CommissionCommunity & Library Services CommissionFree Grocery Food Box for Irvine ResidentsDiversity, Equity, and Inclusion Committee MeetingPlanning CommissionWorkforce Development and Financial Empowerment Workshop21222324252627Subdivision CommitteeZoning Administrator28293031123Wall of Recognition Nomination Period Closingcityofirvine.orgCity Council AgendasCommissions & Committees AgendasGreat Park Board Agendas​ICTV Replays Council, Great ParkTransparency PortalCity of Irvine Website PoliciesCatalog of Enterprise SystemsBusiness LicensingInteractive District DashboardLobbyist Regulations and ReportsVisit Arts in IrvineQuick LinksCity CompensationeCommentFOR Families & Families in CrisisHomeless ServicesImmigration ResourcesInteractive City MapsIrvine Community GuideRoad Construction MapContactCity Council & StaffInvite City CouncilHow Can We Help?Report Short-Term Rentals & Boarding HousesMedia & Webmaster ContactsSign up for City emailsReport Web Accessibility IssuesCivic Center Address & Hours of Operation1 Civic Center PlazaIrvine, CA 92606-5207Phone: 949-724-6000Mon–Thur: 7:30 a.m.–5:30 p.m.Friday: 8 a.m.–5 p.m.© Copyright 2025 City of Irvine, CaliforniaFacebookTwitterYouTubeInstagramLinkedInFlickrContactAccess",
      "url": "https://www.cityofirvine.org/news-media/events/grid",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "workshop",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "City of IrvineTranslateAfrikaansAlbanianArabicArmenianAzerbaijaniBasqueBelarusianBengaliBosnianBulgarianCatalanCebuanoChinese (Simplified)Chinese (Traditional)CroatianCzechDanishDutchEnglishEsperantoEstonianFilipinoFinnishFrenchGalicianGeorgianGermanGreekGujaratiHaitian CreoleHausaHebrewHindiHmongHungarianIcelandicIgboIndonesianIrishItalianJapaneseJavaneseKannadaKhmerKoreanLaoLatinLatvianLithuanianMacedonianMalayMalteseMaoriMarathiMongolianNepaliNorwegianPersianPolishPortuguesePunjabiRomanianRussianSerbianSlovakSlovenianSomaliSpanishSwahiliSwedishTamilTeluguThaiTurkishUkrainianUrduVietnameseWelshYiddishYorubaZuluText SizeDecrease Font-SizeIncrease Font-SizeSearch formSearchHomeMenuSearchLiveAffordable HousingChild Care & DevelopmentChildren, Teens & FamiliesCity Parks & FacilitiesClasses & ActivitiesDisability ServicesHealth ResourcesIrvine Community GuideIrvine GivesNew to IrvineOlder Adult ServicesRenter ResourcesSchools & LibrariesSeek AssistanceUtilitiesVolunteer OpportunitiesWorkAboutBids and RFP's (Purchasing)City JobsCity ServicesCodes, Licenses & PermitsDoing BusinessOnline Building & Planning ServicesTransportationUtilitiesYouth Employment ResourcesPlayAquatics CentersArts in IrvineAthletics & SportsBikewaysCity CalendarClasses & ActivitiesGreat ParkOpen Space & TrailsParks & FacilitiesRacket SportsSpecial EventsGovernmentCity BudgetCity CouncilCity PoliciesCity PrioritiesCommissionsDepartmentsAdministrative Services DepartmentCity ClerkCity Manager's OfficeCommunications & EngagementCommunity & Library ServicesCommunity DevelopmentHuman Resources DepartmentIrvine Police DepartmentPublic WorksTransportationSustainability DivisionPublic Records RequestSuccessor Agency/Oversight BoardServicesServices A to ZAnimal ServicesCity ClerkDE&IEconomic DevelopmentEnvironmental ProgramsFacility ReservationsGIS / Parcel MapsHealth and Human ServicesHomeless ServicesFOR FamiliesForms DirectoryFrequently Asked QuestionsIrvine Animal Care CenterMilitary / VeteransOlder Adult ServicesOnline Invoice PaymentPublic RecognitionNews & MediaCity CalendarCommunications ToolkitICTVInside IrvinePress InquiriesNewsroomPress ReleasesCommunity Link NewsletterRoad Construction NewsletterContactCity Council & StaffInvite City CouncilHow Can We Help?Report Short-Term Rentals & Boarding HousesMedia & Webmaster ContactsSign up for City EmailsYou are hereHome•News & Media•ListListGridFind EventsKeyword searchDepartment- Any -Aquatics CentersArts in IrvineAthletics & SportsChild Care & DevelopmentCommunity & Library Services DepartmentDisability ServicesGreat ParkIrvine Animal Care CenterIrvine Police DepartmentIrvine Public LibraryMilitary / VeteransRacket SportsSustainability DivisionVenue- Any -Administrative Services DepartmentAdventure PlaygroundAl and Dorothy Keen Center for Senior ResourcesAlderwood Elementary SchoolAlderwood ParkArts & Learning ConservancyATA Martial ArtsBethel Koren ChurchBill Barber ParkBJ's Restaurant & BrewhouseBlue Gum ParkBommer Canyon PreserveBommer Canyon TrailheadBommer Vista PointBonita Canyon Elementary SchoolBrywood Elementary SchoolBrywood ParkCafe RioCanyon ParkCanyon View Elementary SchoolCarrotwood ParkCentral Bark Dog ParkChaparral ParkChild Care Coordination OfficeCitrusglen ParkCity ClerkCity CouncilCity Council ChamberCity Manager's OfficeCity of Irvine – Tennis ProgramCity ParksCode EnforcementCollege ParkCollege Park Elementary SchoolColonel Bill Barber Marine Corps Memorial ParkCommunications & Engagement DepartmentCommunity & Library ServicesCommunity & Library Services DepartmentCommunity DevelopmentCommunity Development: Housing Element UpdateComstock ParkConference and Training Center (CTC)Conference and Training Center (CTC)Coralwood ParkCreekside High School (CHS)Creekview ParkCulverdale Elementary SchoolCypress Community ParkCypress Village Elementary SchoolDavid Sills Lower Peters Canyon Community ParkDeerfield Community ParkDeerfield Elementary SchoolDisability ServicesDisc Golf CourseDovecreek ParkEastshore Elementary SchoolEnvironmental ProgramsFacility ReservationsFivePoint AmphitheatreFlagstone ParkGreat ParkGreat Park GalleryGreat Park IceGreentree Elementary SchoolHarvard Community CenterHarvard Community ParkHarvard Skate ParkHeritage Community ParkHeritage Park Community CenterHeritage Park Community CenterHeritage Park LibraryHeritage Park Sports Fields and ParksHicks Canyon Community ParkHoeptner ParkHomestead ParkHonda CenterHotel IrvineHuman ResourcesHuman Resources DepartmentIl-Do Tae Kwon Do Studio - Heritage PlazaInformation TechnologyIrvine Adult Day Health CenterIrvine Animal Care CenterIrvine Animal Care CenterIrvine Chamber of CommerceIrvine Child Development CenterIrvine Child Resource CenterIrvine Civic CenterIrvine Civic CenterIrvine Fine Arts CenterIrvine Fine Arts CenterIrvine High School (IHS)Irvine High School StadiumIrvine High School StadiumIrvine Historical MuseumIrvine ImprovIrvine LakeIrvine Marriott HotelIrvine Police DepartmentIrvine Police DepartmentIrvine Police DepartmentIrvine Public LibraryIrvine Ranch Conservancy - Portola Field OfficeIrvine Regional ParkIrvine Spectrum CenterIrvine Spectrum CenterIrvine Train StationIrvine Transportation CenterIrvine Unified School District (IUSD)Irvine Valley CollegeJeffrey Park and Ride LotJeffrey Trail Middle SchoolKatie Wheeler LibraryKnollcrest ParkLake Forest Sports Park and Recreation CenterLakeside Middle SchoolLakeview Senior CenterLas Lomas Community ParkLos Olivos Community CenterMagnolia Tree ParkMark Daily Athletic ParkMeadow Park Elementary SchoolMeadowood ParkMike Ward Community ParkMike Ward Community ParkMOD PizzaNewport Coast Community CenterNorthwood Community ParkNorthwood Elementary SchoolNorthwood High School (NHS)Northwood High School Aquatics CenterOak Creek Community ParkOak Creek Elementary SchoolOak Creek Golf CourseOC Fair & Event CenterOCFA Station 27Office of Emergency ManagementOffice of Health & WellnessOpen Space & Nature ProgramsOperations Support FacilityOrange County Fire Authority (OCFA)Orange County Housing AuthorityOrange County Transportation Authority (OCTA)Orange County Vector ControlOrchard ParkPacific Dance StudioPalm Court Arts ComplexPepperwood ParkPianoforte Music Studio - Heritage PlazaPinewood ParkPinewood ParkPlaza ParkPlaza Vista Elementary SchoolPlaza Vista Middle SchoolPortola High School (PHS)Portola Springs Community CenterPortola Springs Elementary SchoolPresley ParkPublic Works & SustainabilityPurchasing DivisionQuail Hill Community CenterQuail Hill Community ParkQuail Hill TrailheadRacquet Club ParkRanch ParkRancho San Joaquin Golf CourseRancho San Joaquin Middle SchoolRancho Senior CenterRed Robin, Irvine Spectrum CenterSan Carlo ParkSan Joaquin High School (SJHS)San Leandro ParkSan Marco ParkSantiago Hills Elementary SchoolSepulveda Vista PointSettlers ParkSierra Vista Middle SchoolSilkwood ParkSouth Coast Chinese Cultural AssociationSouth Coast Chinese Cultural CenterSouth Coast Chinese Cultural CenterSouth Coast Chinese Cultural CenterSouth Lake Middle SchoolSpringbrook Elementary SchoolStone Creek Elementary SchoolStonegate Elementary SchoolStonegate ParkStrawberry Farms Golf CourseSweet Shade Ability CenterSweet Shade Neighborhood ParkSweet Shade ParkSycamore ParkThe Village of HopeTierra Verde IndustriesTrabuco CenterTransportation DepartmentTurtle Rock Community ParkTurtle Rock Elementary SchoolTurtle Rock Nature CenterTustin Unified School District (TUSD)University Community ParkUniversity Community parkUniversity High School (UHS)University of California, Irvine (UCI)University Park Elementary SchoolUniversity Park LibraryValencia ParkValley Oak ParkVeggie Grill – Irvine Spectrum CenterVenado Middle SchoolVerizon Wireless AmphitheatreVista Verde Elementary SchoolVista Verde Middle SchoolWestpark Elementary SchoolWild RiversWildfire GymnasticsWilliam Woollett Jr. Aquatics CenterWillows ParkWindrow Community ParkWoodbridge High School (WHS)Woodbury Community CenterWoodbury Community ParkWoodbury Elementary SchoolYOGASMOGAYouth Employment InformationZoom AcademyNews & MediaCity CalendarCommunications ToolkitICTVInside IrvinePress InquiriesNewsroomPress ReleasesCommunity Link NewsletterRoad Construction NewsletterCity CalendarJanuaryFebruaryMarchAprilMayJuneJulyAugustSeptemberOctoberNovemberDecember2020202120222023202420252026« PrevNext »SunMonTueWedThuFriSat30123456Canceled - Finance Commission MeetingCANCELED- Transportation CommissionCommunity & Library Services CommissionPlanning CommissionWorkforce Development and Financial Empowerment WorkshopHolidayz at the Park78910111213Irvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-OffHealth & Wellness Advisory Committee MeetingCity Council MeetingCANCELED - Subdivision CommitteeZoning AdministratorSustainability CommissionFree Grocery Food Box for Irvine ResidentsWorkforce Development and Financial Empowerment WorkshopIrvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-OffMetrolink Holiday Express TrainMetrolink Holiday Express Train14151617181920Metrolink Holiday Express TrainMetrolink Holiday Express TrainFinance Commission MeetingTransportation CommissionCommunity & Library Services CommissionFree Grocery Food Box for Irvine ResidentsDiversity, Equity, and Inclusion Committee MeetingPlanning CommissionWorkforce Development and Financial Empowerment Workshop21222324252627Subdivision CommitteeZoning Administrator28293031123Wall of Recognition Nomination Period Closingcityofirvine.orgCity Council AgendasCommissions & Committees AgendasGreat Park Board Agendas​ICTV Replays Council, Great ParkTransparency PortalCity of Irvine Website PoliciesCatalog of Enterprise SystemsBusiness LicensingInteractive District DashboardLobbyist Regulations and ReportsVisit Arts in IrvineQuick LinksCity CompensationeCommentFOR Families & Families in CrisisHomeless ServicesImmigration ResourcesInteractive City MapsIrvine Community GuideRoad Construction MapContactCity Council & StaffInvite City CouncilHow Can We Help?Report Short-Term Rentals & Boarding HousesMedia & Webmaster ContactsSign up for City emailsReport Web Accessibility IssuesCivic Center Address & Hours of Operation1 Civic Center PlazaIrvine, CA 92606-5207Phone: 949-724-6000Mon–Thur: 7:30 a.m.–5:30 p.m.Friday: 8 a.m.–5 p.m.© Copyright 2025 City of Irvine, CaliforniaFacebookTwitterYouTubeInstagramLinkedInFlickrContactAccess"
    },
    {
      "title": "Canceled - Finance Commission Meeting",
      "description": "Finance Commission Meeting - Every first and third Monday of the month. Click here to see Finance Commission agendas.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Canceled - Finance Commission Meeting",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/canceled-finance-commission-meeting-65",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Canceled - Finance Commission Meeting"
    },
    {
      "title": "CANCELED- Transportation Commission",
      "description": "Meetings are held on the first and third Tuesday of each month at the Irvine Civic Center, Council Chamber. For directions, please call 949-724-7365. Click hereto view Transportation Commission agendas.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "CANCELED- Transportation Commission",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/transportation-commission-104",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "CANCELED- Transportation Commission"
    },
    {
      "title": "Community & Library Services Commission",
      "description": "Meets on the first and third Wednesday of every month. Click hereto see Community Services Commission agendas.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Community & Library Services Commission",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/community-library-services-commission-8",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Community & Library Services Commission"
    },
    {
      "title": "Workforce Development and Financial Empowerment Workshop",
      "description": "The City of Irvine is hosting a new six-week Workforce Development and Financial Empowerment Workshop for Irvine residents beginning Friday, November 7. The free program, held in collaboration with the Community Action Partnership of Orange County, is tailored to adults who are seeking to strengthen job skills, build confidence, and achieve lasting financial stability and growth. Workshop sessions will take place on Fridays from November 7 to December 19, 2:30 to 4 p.m. at Heritage Park Library. Topics include career exploration, job searching, resume building, and interview skills, as well as financial empowerment. Registration is open to Irvine residents only. Attendance at all six sessions is highly recommended to ensure participants receive the full benefit of the program’s comprehensive curriculum. To sign up or to learn more, contact the Office of Health & Wellness athealthandwellness@cityofirvine.orgor 949-724-6650.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Workforce Development and Financial Empowerment Workshop",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/workforce-development-and-financial-empowerment-workshop-1",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "workshop",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Workforce Development and Financial Empowerment Workshop"
    },
    {
      "title": "Irvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-Off",
      "description": "Drive-thru Drop-off at Irvine Civic Center Sunday, December 7:9 a.m.–NoonWhat to Donate Guidelines All donations should be new and unwrapped. Drop off gifts during business hours at each location. Learn more atcityofirvine.org/holidaytoydrive.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Irvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-Off",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/irvine-211-marine-adoption-committee-holiday-toy-drive-drive",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Irvine 2/11 Marine Adoption Committee Holiday Toy Drive: Drive-Thru Drop-Off"
    },
    {
      "title": "Health & Wellness Advisory Committee Meeting",
      "description": "For information on the Health & Wellness Advisory Committee, visitcityofirvine.org/health-wellness-advisory-committee.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "Health & Wellness Advisory Committee Meeting",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/health-wellness-advisory-committee-meeting",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "Health & Wellness Advisory Committee Meeting"
    },
    {
      "title": "City Council Meeting",
      "description": "To view meetings live on a computer, visitcityofirvine.org/ictvand select \"Watch ICTV Live\". Clickherefor meeting agendas.",
      "start_date": null,
      "end_date": null,
      "start_time": null,
      "end_time": null,
      "start_location": "City Council Meeting",
      "url": "https://www.cityofirvine.org/news-media/calendar-of-events/event/city-council-meeting-183",
      "image_url": "https://www.cityofirvine.org/sites/all/themes/irvine_theme/assets/images/city-of-irvine-logo.svg",
      "event_type": "event",
      "venue_id": 196,
      "city_id": 27,
      "source": "website",
      "source_url": "https://www.cityofirvine.org/irvine-fine-arts-center",
      "organizer": "Irvine Fine Arts Center",
      "meeting_point": "City Council Meeting"
    },
    {
      "title": "Cynthia Daignault: Light Atlas",
      "description": "",
      "start_date": "2025-09-20",
      "end_date": "2026-02-08",
      "start_time": null,
      "end_time": null,
      "start_location": "Orange County Museum of Art (OCMA)",
      "url": "https://ocma.art/exhibitions/cynthia-daignault-light-atlas/",
      "image_url": "https://ocma.art/wp-content/uploads/2025/09/001-250922-OCMA-009-web-1000x564.jpg",
      "event_type": "exhibition",
      "venue_id": 198,
      "city_id": 27,
      "source": "website",
      "source_url": "https://ocma.art/exhibitions",
      "organizer": "Orange County Museum of Art (OCMA)"
    },
    {
      "title": "Art Happy Hour & Pop-Up Talk",
      "description": "",
      "start_date": "2025-12-05",
      "end_date": null,
      "start_time": "17:00:00",
      "end_time": "18:00:00",
      "start_location": "Orange County Museum of Art (OCMA)",
      "url": "https://ocma.art/calendar/art-happy-hour-pop-up-talk-december-25/",
      "image_url": "https://ocma.art/wp-content/uploads/2025/10/ArtHappyHour_Biennial_6-1200x824.png",
      "event_type": "talk",
      "is_baby_friendly": false,
      "is_registration_required": false,
      "registration_info": "",
      "venue_id": 198,
      "city_id": 27,
      "source": "website",
      "source_url": "https://ocma.art/calendar/",
      "organizer": "Orange County Museum of Art (OCMA)"
    },
    {
      "title": "Public Tour",
      "description": "",
      "start_date": "2025-12-07",
      "end_date": null,
      "start_time": "13:00:00",
      "end_time": null,
      "start_location": "Orange County Museum of Art (OCMA)",
      "url": "https://ocma.art/calendar/public-tour-december-25-1/",
      "image_url": "https://ocma.art/wp-content/uploads/2025/11/009-250620-CalBnl-web-1200x824.jpg",
      "event_type": "tour",
      "is_baby_friendly": false,
      "is_registration_required": false,
      "registration_info": "",
      "venue_id": 198,
      "city_id": 27,
      "source": "website",
      "source_url": "https://ocma.art/calendar/",
      "organizer": "Orange County Museum of Art (OCMA)"
    },
    {
      "title": "Art & Play (Ages 0–2)December 10, 2025,",
      "description": "",
      "start_date": "2025-12-10",
      "end_date": null,
      "start_time": "11:00:00",
      "end_time": "13:00:00",
      "start_location": "Orange County Museum of Art (OCMA)",
      "url": "https://ocma.art/calendar/art-play-ages-0-2-december-25/",
      "image_url": "https://ocma.art/wp-content/uploads/2025/11/25le_ArtAndPlay_02_WebImages_3-1200x824.jpg",
      "event_type": "workshop",
      "is_baby_friendly": true,
      "is_registration_required": false,
      "registration_info": "",
      "venue_id": 198,
      "city_id": 27,
      "source": "website",
      "source_url": "https://ocma.art/calendar/",
      "organizer": "Orange County Museum of Art (OCMA)"
    }
  ]
}